import { type Option } from './AutoComplete.types';

export const CITY_DEFAULT: Option[] = [
  { label: 'м. Львів, Львівська обл.', value: 'Львів' },
  { label: 'м. Чернівці, Чернівецька обл.', value: 'Чернівці' },
  {
    label: 'м. Івано-Франківськ, Івано-Франківська обл.',
    value: 'Івано-Франківськ',
  },
  { label: 'м. Рівне, Рівненська обл.', value: 'Рівне' },
  { label: 'м. Київ, Київська обл.', value: 'Київ' },
  { label: 'м. Харків, Харківська обл.', value: 'Харків' },
  { label: 'м. Запоріжжя, Запорізька обл.', value: 'Запоріжжя' },
  { label: 'м. Ужгород, Закарпатська обл.', value: 'Ужгород' },
  { label: 'м. Дніпро, Дніпропетровська обл.', value: 'Дніпро' },
  { label: 'м. Херсон, Херсонська обл.', value: 'Херсон' },
  { label: 'м. Вінниця, Вінницька обл.', value: 'Вінниця' },
  { label: 'м. Житомир, Житомирська обл.', value: 'Житомир' },
  { label: 'м. Кропивницький, Кіровоградська обл.', value: 'Кропивницький' },
  { label: 'м. Луцьк, Волинська обл.', value: 'Луцьк' },
  { label: 'м. Миколаїв, Миколаївська обл.', value: 'Миколаїв' },
  { label: 'м. Полтава, Полтавська обл.', value: 'Полтава' },
  { label: 'м. Суми, Сумська обл.', value: 'Суми' },
  { label: 'м. Тернопіль, Тернопільська обл.', value: 'Тернопіль' },
  { label: 'м. Хмельницький, Хмельницька обл.', value: 'Хмельницький' },
  { label: 'м. Черкаси, Черкаська обл.', value: 'Черкаси' },
  { label: 'м. Чернігів, Чернігівська обл.', value: 'Чернігів' },
];
