import authorImg from '@/assets/rep/authors/01.png';
export const author = {
  name: 'Алекс Т. Сміт',
  img: authorImg,
  id: 1,
  descriptions: {
    description: `[[Алекс Т. Сміт]] - сучасний британський письменник, який прославився на весь світ своїми чуйними та дотепними дитячими книжками, які полюбилися малечі як на його батьківщині, так і дітлахам 
за кордоном! !p
Майбутній автор та ілюстратор чисельних книжок народився у 1985 році в місті Ковентрі, малювати та записувати історії він почав відтоді, як навчився тримати в руках олівець, розглянувши кілька варіантів кар'єри - від космічного мандрівника до кондитера, Алекс вирішив опанувати професію ілюстратора, яким мріяв бути з п'яти років.
 !p Працювати над своїм першим замовленням він почав одразу після здобуття освіти, наразі 
Алекс Т. Сміт співпрацює з найрізноманітнішими клієнтами не лише у видавничій індустрії, а також пише та ілюструє власні книжки, багато з яких здобули літературні нагороди.
`,
    title:
      'Книги [[Алекса Т. Сміта]] - це декілька літературних серій та самостійних книжок, найвідоміші з яких:',

    books:
      '!s !li «серія Містер Пінґвін»: !li «Містер Пінґвін. Книга 1. Втрачений скарб»; !id=1 !li «Містер Пінґвін. Книга 2. Фортеця таємниць»; !li «Містер Пінґвін. Книга 3. Катастрофа в круїзі»; !li «Містер Пінґвін. Книга 4. Моторошна гробниця»; !s !li «серія Claude»: !li «Claude in the City»; !li «Claude on Holiday»; !li «Claude at the Circus»; !li «Claude in the Country»; !li «Claude in the Spotlight»; !li «Claude on the Slopes»; !li «Claude at Sea»; !li «Claude: Lights! Camera! Action!»; !li «Claude Going for Gold»; !li «Santa Claude»; !li «Claude at the Palace»; !s !li Самостійні твори: !li «Ґрампус і його Жахливий та Підступний Різдвяний План»; !li «Вінстон і Різдвяний лист»; !li «Вінстон повертається додому на Різдво»;',
  },
};
