export const ukraine = {
  lang: 'Українська',
  header: {
    links: {
      admin: 'Адмін',
      catalog: 'Каталог',
      children: 'Дитяча література',
    },
    menu: {
      login: 'Логін',
      register: 'Реєстрація',
      support: 'Підтримка',
    },
    search: {
      placeholder: 'Шукати',
      search: 'Шукати {{value}}',
      offers: 'Пропозиції',
      books: 'Книги',
      'no-result': 'За вашим запитом не знайдено жодних результатів',
      'show-all': 'Показати все',
    },
  },
  footer: {
    links: {
      main: 'Головна сторінка',
      delivery: 'Доставка та оплата',
      support: 'Зворотній зв’язок',
    },
    copyright: 'Bookmate 2024. Усі права захищено',
  },
  home: {
    banner: {
      h1: 'Досліджуй безмежні сторінки',
      description: `Знайди свою наступну пригоду
в нашій книжковій інтернет-крамниці!`,
      button: 'В Каталог',
    },
    'best-sellers': {
      title: 'Хіти продажів',
      button: 'Більше',
    },
    collage: {
      title: 'Найбільший книжковий магазин у вашому регіоні',
      description: `Приєднуйтесь до нашої спільноти книголюбів: Створіть свій обліковий запис і пориньте в нескінченну насолоду від читання!`,
      button: 'Створити акаунт',
    },
    sales: {
      title: 'Вигідні пропозиції',
      sale: 'Знижки {{value}}',
    },
  },
};
