import { ORDER_STATUS } from './constants';

export const clientArr = [
  { id: 1, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 2, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 3, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 4, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 5, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 6, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
];

export const orderList = [
  {
    id: 10,
    address: 'Нова Пошта №35 вулиця Канатна, 83',
    status: 'Виконано',
    price: '230',
  },
  {
    id: 12,
    address: 'Нова Пошта №35 вулиця Канатна, 83',
    status: 'Виконано',
    price: '230',
  },
];

export const ORDER_LIST = [
  {
    orderId: '12345',
    userId: '12345',
    book: 'Містер Пінґвін. Втрачений скарб. Алекс Т. Сміт',
    quality: '11',
    price: '240',
    status: ORDER_STATUS.Completed,
  },
  {
    orderId: '22345',
    userId: '22345',
    book: 'Містер Пінґвін. Втрачений скарб. Алекс Т. Сміт',
    quality: '11',
    price: '240',
    status: ORDER_STATUS.Delivered,
  },
  {
    orderId: '32345',
    userId: '42345',
    book: 'Містер Пінґвін. Втрачений скарб. Алекс Т. Сміт',
    quality: '11',
    price: '240',
    status: ORDER_STATUS.Pending,
  },
];

export const category = `Фантастика зосереджена на наукових передумовах: тут досліджуються ідеї майбутнього, технологій і космосу, як у творах [[Айзека Азімова]] чи [[Артура Кларка]]. Наукова фантастика часто ставить питання про природу людства, етичні аспекти прогресу та штучний інтелект. !p  Фентезі ж розгортається у вигаданих світах із магією, легендами та героїчними пригодами, як у [["Володарі перснів" Толкіна]] або [["Пісні льоду й полум'я" Джорджа Мартіна]]. Тут ключовим є протистояння добра і зла, а також мандрівка, що змінює героїв. Обидва жанри захоплюють читачів своєю здатністю переносити їх у неймовірні всесвіти, де можливо все.`;
export const COLLECTION: Record<
  string,
  { title: string; description: string }
> = {
  '11': {
    title: 'Пригодницькі твори для дітей',
    description: `Захопливі пригоди для юних мрійників! У цій колекції зібрані найкращі історії, сповнені неймовірних подій, цікавих персонажів і незабутніх подорожей. Вирушайте разом із героями у пошуках скарбів, розкривайте таємниці та долайте захоплюючі випробування. !p
Серед авторів, чиї твори надихають покоління дітей, — [[Жюль Верн («Навколо світу за 80 днів»), Роберт Луїс Стівенсон («Острів скарбів»), Марк Твен («Пригоди Тома Сойєра»)]] та [[Астрід Ліндґрен («Пеппі Довгапанчоха»)]]. Ці книги подарують море вражень і надихнуть на власні відкриття!`,
  },
  '9': {
    title: 'Сучасна українська проза',
    description: `Сучасна українська проза — це яскравий зріз сьогодення, де оживають неповторні історії, тонкі людські емоції та соціальні виклики. У цій колекції зібрано твори, що змушують замислитися, співпереживати й відкривати нові грані української культури. !p
Серед авторів — [[Сергій Жадан («Інтернат»), Оксана Забужко («Музей покинутих секретів»), Юрій Андрухович («Рекреації»), Тарас Прохасько («НепрОсті»)]] та [[Софія Андрухович («Амадока»)]]. Від інтимних роздумів до епічних сюжетів — ця література об'єднує традиції і сміливий погляд у майбутнє.`,
  },
  '1': {
    title: 'Біографічні книги',
    description: `Захопливі історії реальних людей, які змінили світ. У цій колекції зібрано біографії видатних діячів, художників, науковців, підприємців і політиків. Їхні життя — це джерело натхнення, сили та мудрості. !p
Серед ключових книг — [[«Стів Джобс» Волтера Айзексона, «Малала. Моя історія» Малали Юсафзай, «Леонардо да Вінчі» Волтера Айзексона]] та [[«Довга дорога до свободи» Нельсона Мандели]]. Кожна сторінка відкриває секрети успіху, боротьби та особистісного розвитку, надихаючи на власні звершення."`,
  },
  '2': {
    title: 'Романи про кохання',
    description: `Романтичні історії, які зачіпають серце й залишають незабутні враження. У цій колекції зібрані твори, що розповідають про силу кохання, його випробування та тріумфи. !p
Серед авторів, чиї романи стали класикою жанру, — [[Джейн Остін («Гордість і упередження»), Шарлотта Бронте («Джейн Ейр»), Еріка Леонард Джеймс («П’ятдесят відтінків сірого»)]] та [[Ніколас Спаркс («Щоденник пам’яті»)]]. Ці книги подарують вам емоційні переживання, щиру ніжність і віру в силу почуттів, які змінюють життя.`,
  },
};

export const Authors = Array.from({ length: 36 }, (_, index) => ({
  id: index + 1,
  name: 'Алекс Т. Сміт',
  books: 4,
}));
