import { ORDER_STATUS } from './constants';

export const clientArr = [
  { id: 1, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 2, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 3, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 4, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 5, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
  { id: 6, phone: '+ 380 000 000 000', user: 'Мельник Валерія', city: 'Одеса' },
];

export const orderList = [
  {
    id: 10,
    address: 'Нова Пошта №35 вулиця Канатна, 83',
    status: 'Виконано',
    price: '230',
  },
  {
    id: 12,
    address: 'Нова Пошта №35 вулиця Канатна, 83',
    status: 'Виконано',
    price: '230',
  },
];

export const ORDER_LIST = [
  {
    orderId: '12345',
    userId: '12345',
    book: 'Містер Пінґвін. Втрачений скарб. Алекс Т. Сміт',
    quality: '11',
    price: '240',
    status: ORDER_STATUS.Completed,
  },
  {
    orderId: '22345',
    userId: '22345',
    book: 'Містер Пінґвін. Втрачений скарб. Алекс Т. Сміт',
    quality: '11',
    price: '240',
    status: ORDER_STATUS.Delivered,
  },
  {
    orderId: '32345',
    userId: '42345',
    book: 'Містер Пінґвін. Втрачений скарб. Алекс Т. Сміт',
    quality: '11',
    price: '240',
    status: ORDER_STATUS.Pending,
  },
];

export const category = `Фантастика зосереджена на наукових передумовах: тут досліджуються ідеї майбутнього, технологій і космосу, як у творах [[Айзека Азімова]] чи [[Артура Кларка]]. Наукова фантастика часто ставить питання про природу людства, етичні аспекти прогресу та штучний інтелект. !p  Фентезі ж розгортається у вигаданих світах із магією, легендами та героїчними пригодами, як у [["Володарі перснів" Толкіна]] або [["Пісні льоду й полум'я" Джорджа Мартіна]]. Тут ключовим є протистояння добра і зла, а також мандрівка, що змінює героїв. Обидва жанри захоплюють читачів своєю здатністю переносити їх у неймовірні всесвіти, де можливо все.`;
