import categoryImg1 from '@/assets/rep/category/colection4.png';

export const ADMIN_LIST = [
  { id: 1, name: 'Введення книжок', url: '/admin/books' },
  { id: 2, name: 'Введення категорій', url: '/admin/categories' },
  { id: 8, name: 'Створення колекції', url: '/admin/collections' },
  { id: 6, name: 'Введення авторів', url: '/admin/authors' },
  { id: 7, name: 'Введення мов', url: '/admin/language' },
  { id: 3, name: 'Клієнти зареєстровані', url: '/admin/client' },
  { id: 4, name: 'Клієнти не зареєстровані', url: '/admin/clientN' },
  { id: 5, name: 'Замовлення', url: '/admin/order' },
];

export const COLLECTIONS_DATA = [
  {
    id: 1,
    name: 'Пригодницькі твори для дітей',
    img: categoryImg1,
    description1:
      'Захопливі пригоди для юних мрійників! У цій колекції зібрані найкращі історії, сповнені неймовірних подій, цікавих персонажів і незабутніх подорожей. Вирушайте разом із героями у пошуках скарбів, розкривайте таємниці та долайте захоплюючі випробування.',
    description2:
      'Серед авторів, чиї твори надихають покоління дітей, — Жюль Верн («Навколо світу за 80 днів»), Роберт Луїс Стівенсон («Острів скарбів»), Марк Твен («Пригоди Тома Сойєра») та Астрід Ліндґрен («Пеппі Довгапанчоха»). Ці книги подарують море вражень і надихнуть на власні відкриття!',
    books: 6,
  },
  {
    id: 2,
    name: 'Пригодницькі твори для дітей',
    img: categoryImg1,
    description1:
      'Захопливі пригоди для юних мрійників! У цій колекції зібрані найкращі історії, сповнені неймовірних подій, цікавих персонажів і незабутніх подорожей. Вирушайте разом із героями у пошуках скарбів, розкривайте таємниці та долайте захоплюючі випробування.',
    description2:
      'Серед авторів, чиї твори надихають покоління дітей, — Жюль Верн («Навколо світу за 80 днів»), Роберт Луїс Стівенсон («Острів скарбів»), Марк Твен («Пригоди Тома Сойєра») та Астрід Ліндґрен («Пеппі Довгапанчоха»). Ці книги подарують море вражень і надихнуть на власні відкриття!',
    books: 6,
  },
  {
    id: 3,
    name: 'Пригодницькі твори для дітей',
    img: categoryImg1,
    description1:
      'Захопливі пригоди для юних мрійників! У цій колекції зібрані найкращі історії, сповнені неймовірних подій, цікавих персонажів і незабутніх подорожей. Вирушайте разом із героями у пошуках скарбів, розкривайте таємниці та долайте захоплюючі випробування.',
    description2:
      'Серед авторів, чиї твори надихають покоління дітей, — Жюль Верн («Навколо світу за 80 днів»), Роберт Луїс Стівенсон («Острів скарбів»), Марк Твен («Пригоди Тома Сойєра») та Астрід Ліндґрен («Пеппі Довгапанчоха»). Ці книги подарують море вражень і надихнуть на власні відкриття!',
    books: 6,
  },
  {
    id: 4,
    name: 'Пригодницькі твори для дітей',
    img: categoryImg1,
    description1:
      'Захопливі пригоди для юних мрійників! У цій колекції зібрані найкращі історії, сповнені неймовірних подій, цікавих персонажів і незабутніх подорожей. Вирушайте разом із героями у пошуках скарбів, розкривайте таємниці та долайте захоплюючі випробування.',
    description2:
      'Серед авторів, чиї твори надихають покоління дітей, — Жюль Верн («Навколо світу за 80 днів»), Роберт Луїс Стівенсон («Острів скарбів»), Марк Твен («Пригоди Тома Сойєра») та Астрід Ліндґрен («Пеппі Довгапанчоха»). Ці книги подарують море вражень і надихнуть на власні відкриття!',
    books: 6,
  },
];
